unit DriverTypes;

interface

type
  { TParameterValueRec }

  TParameterValueRec = record
    ID: Integer;
    Value: Integer;
  end;

  { TTableParameterRec }

  TTableParameterRec = record
    ID: Integer;
    Name: WideString;
    Table: Integer;
    Row: Integer;
    Field: Integer;
    Size: Integer;
    FieldType: Integer;
    MinValue: Integer;
    MaxValue: Integer;
    DefValue: WideString;
  end;

  { TPrinterModelRec }

  TPrinterModelRec = packed record
    ID: Integer;
    Name: string;
    CapShortEcrStatus: Boolean;         // Short ECR status available
    CapCoverSensor: Boolean;            // Cover sensor present
    CapJrnPresent: Boolean;             // Journal present
    CapJrnEmptySensor: Boolean;         // Journal empty sensor present
    CapJrnNearEndSensor: Boolean;       // Journal near end sensor present
    CapRecPresent: Boolean;             // Receipt paper present
    CapRecEmptySensor: Boolean;         // Receipt paper empty sensor present
    CapRecNearEndSensor: Boolean;       // Receipt paper near end sensor present
    CapSlpFullSlip: Boolean;            // Full slip size available
    CapSlpEmptySensor: Boolean;         // Slip upper sensor present
    CapSlpFiscalDocument: Boolean;      // Fiscal slip available
    CapSlpNearEndSensor: Boolean;       // Slip lower sensor available
    CapSlpPresent: Boolean;             // Slip present
    CapSetHeader: Boolean;              // Header is editable
    CapSetTrailer: Boolean;             // Trailer is editable
    CapRecLever: Boolean;               // Receipt lever is present
    CapJrnLever: Boolean;               // Journal lever is present
    CapFixedTrailer: Boolean;           // Trailer is fixed and can not be removed
    CapDisableTrailer: Boolean;
    NumHeaderLines: Integer;
    NumTrailerLines: Integer;
    StartHeaderLine: Integer;
    StartTrailerLine: Integer;
    BaudRates: string;
    PrintWidth: Integer;                // Print width
    MaxGraphicsWidth: Word;             // Max graphics width
    MaxGraphicsHeight: Word;            // Max graphics height
    CapFullCut: Boolean;                // Printer supports full paper cut
    CapPartialCut: Boolean;             // Printer supports partial paper cut
    CombLineNumber: Integer;            // Line number from head to comb
    BarcodeSwapBytes: Boolean;          // Swap bytes in barcode line
    HeaderTableNumber: Integer;
    TrailerTableNumber: Integer;
    CapAttributes: Boolean;
    CapJournalReport: Boolean;
    CapNonfiscalDocument: Boolean;
    CapGraphics: Boolean;
    CapGraphicsEx: Boolean;
  end;

const
  /////////////////////////////////////////////////////////////////////////////
  // Enabled values

  VALUEID_DISABLED  = 0;
  VALUEID_ENABLED   = 1;

  /////////////////////////////////////////////////////////////////////////////
  // ValueID

  VALUEID_CUT_NONE            = 0;
  VALUEID_CUT_FULL            = 1;
  VALUEID_CUT_PARTIAL         = 2;

  VALUEID_ZREPORT_TYPE_LONG       = 0;
  VALUEID_ZREPORT_TYPE_SHORT      = 1;

  /////////////////////////////////////////////////////////////////////////////
  // CutType values

  DRIVER_CUTTYPE_FULL          = 0;    // Full
  DRIVER_CUTTYPE_PARTIAL       = 1;    // Partial
  DRIVER_CUTTYPE_NONE          = 2;    // None

  /////////////////////////////////////////////////////////////////////////////
  // ParameterID values

  /////////////////////////////////////////////////////////////////////////////
  // 1, рхо х пефхл йюяяш

  PARAMID_STORE_ID = 1; // 1,1,1 мнлеп ййл б люцюгхме, "1"
  PARAMID_AUTO_CASHOUT = 2; // 1,1,2 юбр. намскемхе демефмни мюкхвмнярх, "0"
  PARAMID_PRINT_TRAILER = 3; // 1,1,3 оевюрэ пейкюлмнцн рейярю, "0"
  PARAMID_PRINT_FMRECNUM = 4; // 1,1,4 оевюрэ нярюрйнб то б нрвере, "0"
  PARAMID_PRINT_GRAND_TOTAL = 5; // 1,1,5 оевюрэ менамскъелни ясллш, "1"
  PARAMID_CASH_DRAWER_ENABLED = 6; // 1,1,6 пюанрю я демефмшл ъыхйнл, "1"
  PARAMID_CUT_TYPE = 7; // 1,1,7 нрпегйю вейю, "0"
  PARAMID_PRINT_QUANTITY_FRACTION = 8; // 1,1,8 оевюрюрэ дпнамне б йнкхвеярбе, "0"
  PARAMID_9 = 9; // 1,1,9 кнц. спнбемэ дюр. демефмнцн ъыхйю, "0"
  PARAMID_10 = 10; // 1,1,10 дкхрекэмнярэ хло. демефмнцн ъыхйю, "10"
  PARAMID_11 = 11; // 1,1,11 дкхрекэмнярэ оюсгш демефмнцн ъыхйю, "1"
  PARAMID_12 = 12; // 1,1,12 йнкхвеярбн хло. демефмнцн ъыхйю, "1"
  PARAMID_13 = 13; // 1,1,13 хяонкэгнбюмхе беянбшу дюрвхйнб, "0"
  PARAMID_14 = 14; // 1,1,14 мювхякемхе мюкнцнб, "0"
  PARAMID_15 = 15; // 1,1,15 юбрнлюрхвеяйхи оепебнд бпелемх, "0"
  PARAMID_16 = 16; // 1,1,16 оевюрэ мюкнцнб, "0"
  PARAMID_17 = 17; // 1,1,17 оевюрэ гюцнкнбйю, "0"
  PARAMID_18 = 18; // 1,1,18 оевюрэ едхмхвмнцн йнкхвеярбю, "0"
  PARAMID_19 = 19; // 1,1,19 янупюмърэ ярпнйх б астепе вейю, "0"
  PARAMID_20 = 20; // 1,1,20 оевюрэ вейю он гюйпшрхч, "0"
  PARAMID_21 = 21; // 1,1,21 опнлнрйю оепед нрпегйни, "0"
  PARAMID_22 = 22; // 1,1,22 нрпегйю опх нрйпшрнл вейе, "0"
  PARAMID_23 = 23; // 1,1,23 гюопер мскебнцн вейю, "0"
  PARAMID_24 = 24; // 1,1,24 нрярсо б ярпнйе рхонб нокюрш, "1"
  PARAMID_RECFORMAT_ENABLED = 25; // 1,1,25 хяонкэгнбюмхе тнплюрхпнбюмхъ б вейе, "0"
  PARAMID_26 = 26; // 1,1,26 намскемхе явервхйю вейнб, "0"
  PARAMID_27 = 27; // 1,1,27 йнмрпнкэ бпелемх, "0"
  PARAMID_28 = 28; // 1,1,28 нрйкчвемхе гбсйю опх ньхайюу, "0"
  PARAMID_29 = 29; // 1,1,29 лефярпнвмши хмрепбюк, "5"
  PARAMID_Z_REPORT_TYPE = 30; // 1,1,30 рхо ясрнвмнцн нрверю, "1"
  PARAMID_CONDENSED_FONT = 31; // 1,1,31 яфюрхе ьпхтрю мю вейнбни кемре, "0"
  PARAMID_32 = 32; // 1,1,32 пюгцнм опх оевюрх, "1"
  PARAMID_33 = 33; // 1,1,33 йнппейжхъ ъпйнярх, "0"
  PARAMID_34 = 34; // 1,1,34 ъпйнярэ оевюрх, "2"
  PARAMID_35 = 35; // 1,1,35 оевюрэ рхонб нокюрш, "1"
  PARAMID_36 = 36; // 1,1,36 онкнфемхе опхмрепю, "0"
  PARAMID_37 = 37; // 1,1,37 оевюрэ пмл, "0"
  PARAMID_38 = 38; // 1,1,38 сйнпнвеммне йкхье, "0"

  /////////////////////////////////////////////////////////////////////////////
  // 2, оюпнкх йюяяхпнб х юдлхмхярпюрнпнб
  PARAMID_CASHIER_PASS_1 = 39; // 2,1,1 оюпнкх йюяяхпнб, "1"
  PARAMID_CASHIER_NAME_1 = 40; // 2,1,2 пейбхгхрш йюяяхпнб, "йюяяхп 1"
  PARAMID_CASHIER_PASS_2 = 41; // 2,2,1 оюпнкх йюяяхпнб, "2"
  PARAMID_CASHIER_NAME_2 = 42; // 2,2,2 пейбхгхрш йюяяхпнб, "йюяяхп 2"
  PARAMID_CASHIER_PASS_3 = 43; // 2,3,1 оюпнкх йюяяхпнб, "3"
  PARAMID_CASHIER_NAME_3 = 44; // 2,3,2 пейбхгхрш йюяяхпнб, "йюяяхп 3"
  PARAMID_CASHIER_PASS_4 = 45; // 2,4,1 оюпнкх йюяяхпнб, "4"
  PARAMID_CASHIER_NAME_4 = 46; // 2,4,2 пейбхгхрш йюяяхпнб, "йюяяхп 4"
  PARAMID_CASHIER_PASS_5 = 47; // 2,5,1 оюпнкх йюяяхпнб, "5"
  PARAMID_CASHIER_NAME_5 = 48; // 2,5,2 пейбхгхрш йюяяхпнб, "йюяяхп 5"
  PARAMID_CASHIER_PASS_6 = 49; // 2,6,1 оюпнкх йюяяхпнб, "6"
  PARAMID_CASHIER_NAME_6 = 50; // 2,6,2 пейбхгхрш йюяяхпнб, "йюяяхп 6"
  PARAMID_CASHIER_PASS_7 = 51; // 2,7,1 оюпнкх йюяяхпнб, "7"
  PARAMID_CASHIER_NAME_7 = 52; // 2,7,2 пейбхгхрш йюяяхпнб, "йюяяхп 7"
  PARAMID_CASHIER_PASS_8 = 53; // 2,8,1 оюпнкх йюяяхпнб, "8"
  PARAMID_CASHIER_NAME_8 = 54; // 2,8,2 пейбхгхрш йюяяхпнб, "йюяяхп 8"
  PARAMID_CASHIER_PASS_9 = 55; // 2,9,1 оюпнкх йюяяхпнб, "9"
  PARAMID_CASHIER_NAME_9 = 56; // 2,9,2 пейбхгхрш йюяяхпнб, "йюяяхп 9"
  PARAMID_CASHIER_PASS_10 = 57; // 2,10,1 оюпнкх йюяяхпнб, "10"
  PARAMID_CASHIER_NAME_10 = 58; // 2,10,2 пейбхгхрш йюяяхпнб, "йюяяхп 10"
  PARAMID_CASHIER_PASS_11 = 59; // 2,11,1 оюпнкх йюяяхпнб, "11"
  PARAMID_CASHIER_NAME_11 = 60; // 2,11,2 пейбхгхрш йюяяхпнб, "йюяяхп 11"
  PARAMID_CASHIER_PASS_12 = 61; // 2,12,1 оюпнкх йюяяхпнб, "12"
  PARAMID_CASHIER_NAME_12 = 62; // 2,12,2 пейбхгхрш йюяяхпнб, "йюяяхп 12"
  PARAMID_CASHIER_PASS_13 = 63; // 2,13,1 оюпнкх йюяяхпнб, "13"
  PARAMID_CASHIER_NAME_13 = 64; // 2,13,2 пейбхгхрш йюяяхпнб, "йюяяхп 13"
  PARAMID_CASHIER_PASS_14 = 65; // 2,14,1 оюпнкх йюяяхпнб, "14"
  PARAMID_CASHIER_NAME_14 = 66; // 2,14,2 пейбхгхрш йюяяхпнб, "йюяяхп 14"
  PARAMID_CASHIER_PASS_15 = 67; // 2,15,1 оюпнкх йюяяхпнб, "15"
  PARAMID_CASHIER_NAME_15 = 68; // 2,15,2 пейбхгхрш йюяяхпнб, "йюяяхп 15"
  PARAMID_CASHIER_PASS_16 = 69; // 2,16,1 оюпнкх йюяяхпнб, "16"
  PARAMID_CASHIER_NAME_16 = 70; // 2,16,2 пейбхгхрш йюяяхпнб, "йюяяхп 16"
  PARAMID_CASHIER_PASS_17 = 71; // 2,17,1 оюпнкх йюяяхпнб, "17"
  PARAMID_CASHIER_NAME_17 = 72; // 2,17,2 пейбхгхрш йюяяхпнб, "йюяяхп 17"
  PARAMID_CASHIER_PASS_18 = 73; // 2,18,1 оюпнкх йюяяхпнб, "18"
  PARAMID_CASHIER_NAME_18 = 74; // 2,18,2 пейбхгхрш йюяяхпнб, "йюяяхп 18"
  PARAMID_CASHIER_PASS_19 = 75; // 2,19,1 оюпнкх йюяяхпнб, "19"
  PARAMID_CASHIER_NAME_19 = 76; // 2,19,2 пейбхгхрш йюяяхпнб, "йюяяхп 19"
  PARAMID_CASHIER_PASS_20 = 77; // 2,20,1 оюпнкх йюяяхпнб, "20"
  PARAMID_CASHIER_NAME_20 = 78; // 2,20,2 пейбхгхрш йюяяхпнб, "йюяяхп 20"
  PARAMID_CASHIER_PASS_21 = 79; // 2,21,1 оюпнкх йюяяхпнб, "21"
  PARAMID_CASHIER_NAME_21 = 80; // 2,21,2 пейбхгхрш йюяяхпнб, "йюяяхп 21"
  PARAMID_CASHIER_PASS_22 = 81; // 2,22,1 оюпнкх йюяяхпнб, "22"
  PARAMID_CASHIER_NAME_22 = 82; // 2,22,2 пейбхгхрш йюяяхпнб, "йюяяхп 22"
  PARAMID_CASHIER_PASS_23 = 83; // 2,23,1 оюпнкх йюяяхпнб, "23"
  PARAMID_CASHIER_NAME_23 = 84; // 2,23,2 пейбхгхрш йюяяхпнб, "йюяяхп 23"
  PARAMID_CASHIER_PASS_24 = 85; // 2,24,1 оюпнкх йюяяхпнб, "24"
  PARAMID_CASHIER_NAME_24 = 86; // 2,24,2 пейбхгхрш йюяяхпнб, "йюяяхп 24"
  PARAMID_CASHIER_PASS_25 = 87; // 2,25,1 оюпнкх йюяяхпнб, "25"
  PARAMID_CASHIER_NAME_25 = 88; // 2,25,2 пейбхгхрш йюяяхпнб, "йюяяхп 25"
  PARAMID_CASHIER_PASS_26 = 89; // 2,26,1 оюпнкх йюяяхпнб, "26"
  PARAMID_CASHIER_NAME_26 = 90; // 2,26,2 пейбхгхрш йюяяхпнб, "йюяяхп 26"
  PARAMID_CASHIER_PASS_27 = 91; // 2,27,1 оюпнкх йюяяхпнб, "27"
  PARAMID_CASHIER_NAME_27 = 92; // 2,27,2 пейбхгхрш йюяяхпнб, "йюяяхп 27"
  PARAMID_CASHIER_PASS_28 = 93; // 2,28,1 оюпнкх йюяяхпнб, "28"
  PARAMID_CASHIER_NAME_28 = 94; // 2,28,2 пейбхгхрш йюяяхпнб, "йюяяхп 28"
  PARAMID_CASHIER_PASS_29 = 95; // 2,29,1 оюпнкх йюяяхпнб, "29"
  PARAMID_CASHIER_NAME_29 = 96; // 2,29,2 пейбхгхрш йюяяхпнб, "юдлхмхярпюрнп"
  PARAMID_CASHIER_PASS_30 = 97; // 2,30,1 оюпнкх йюяяхпнб, "30"
  PARAMID_CASHIER_NAME_30 = 98; // 2,30,2 пейбхгхрш йюяяхпнб, "яхяр. юдлхмхярпюрнп"

  /////////////////////////////////////////////////////////////////////////////
  // 3, рюакхжю оепебндю бпелемх

  PARAMID_99 = 99; // 3,1,1 пюгпеьемхе оепебндю, "0"
  PARAMID_100 = 100; // 3,1,2 вхякн, "31"
  PARAMID_101 = 101; // 3,1,3 леяъж, "3"
  PARAMID_102 = 102; // 3,1,4 бпелъ цндю, "2002 цнд беямю"
  PARAMID_103 = 103; // 3,2,1 пюгпеьемхе оепебндю, "0"
  PARAMID_104 = 104; // 3,2,2 вхякн, "27"
  PARAMID_105 = 105; // 3,2,3 леяъж, "10"
  PARAMID_106 = 106; // 3,2,4 бпелъ цндю, "2002 цнд няемэ"
  PARAMID_107 = 107; // 3,3,1 пюгпеьемхе оепебндю, "1"
  PARAMID_108 = 108; // 3,3,2 вхякн, "30"
  PARAMID_109 = 109; // 3,3,3 леяъж, "3"
  PARAMID_110 = 110; // 3,3,4 бпелъ цндю, "2003 цнд беямю"
  PARAMID_111 = 111; // 3,4,1 пюгпеьемхе оепебндю, "0"
  PARAMID_112 = 112; // 3,4,2 вхякн, "26"
  PARAMID_113 = 113; // 3,4,3 леяъж, "10"
  PARAMID_114 = 114; // 3,4,4 бпелъ цндю, "2003 цнд няемэ"
  PARAMID_115 = 115; // 3,5,1 пюгпеьемхе оепебндю, "1"
  PARAMID_116 = 116; // 3,5,2 вхякн, "28"
  PARAMID_117 = 117; // 3,5,3 леяъж, "3"
  PARAMID_118 = 118; // 3,5,4 бпелъ цндю, "2004 цнд беямю"
  PARAMID_119 = 119; // 3,6,1 пюгпеьемхе оепебндю, "0"
  PARAMID_120 = 120; // 3,6,2 вхякн, "31"
  PARAMID_121 = 121; // 3,6,3 леяъж, "10"
  PARAMID_122 = 122; // 3,6,4 бпелъ цндю, "2004 цнд няемэ"
  PARAMID_123 = 123; // 3,7,1 пюгпеьемхе оепебндю, "1"
  PARAMID_124 = 124; // 3,7,2 вхякн, "27"
  PARAMID_125 = 125; // 3,7,3 леяъж, "3"
  PARAMID_126 = 126; // 3,7,4 бпелъ цндю, "2005 цнд беямю"
  PARAMID_127 = 127; // 3,8,1 пюгпеьемхе оепебндю, "0"
  PARAMID_128 = 128; // 3,8,2 вхякн, "30"
  PARAMID_129 = 129; // 3,8,3 леяъж, "10"
  PARAMID_130 = 130; // 3,8,4 бпелъ цндю, "2005 цнд няемэ"
  PARAMID_131 = 131; // 3,9,1 пюгпеьемхе оепебндю, "1"
  PARAMID_132 = 132; // 3,9,2 вхякн, "26"
  PARAMID_133 = 133; // 3,9,3 леяъж, "3"
  PARAMID_134 = 134; // 3,9,4 бпелъ цндю, "2006 цнд беямю"
  PARAMID_135 = 135; // 3,10,1 пюгпеьемхе оепебндю, "0"
  PARAMID_136 = 136; // 3,10,2 вхякн, "29"
  PARAMID_137 = 137; // 3,10,3 леяъж, "10"
  PARAMID_138 = 138; // 3,10,4 бпелъ цндю, "2006 цнд няемэ"
  PARAMID_139 = 139; // 3,11,1 пюгпеьемхе оепебндю, "1"
  PARAMID_140 = 140; // 3,11,2 вхякн, "25"
  PARAMID_141 = 141; // 3,11,3 леяъж, "3"
  PARAMID_142 = 142; // 3,11,4 бпелъ цндю, "2007 цнд беямю"
  PARAMID_143 = 143; // 3,12,1 пюгпеьемхе оепебндю, "0"
  PARAMID_144 = 144; // 3,12,2 вхякн, "28"
  PARAMID_145 = 145; // 3,12,3 леяъж, "10"
  PARAMID_146 = 146; // 3,12,4 бпелъ цндю, "2007 цнд няемэ"
  PARAMID_147 = 147; // 3,13,1 пюгпеьемхе оепебндю, "1"
  PARAMID_148 = 148; // 3,13,2 вхякн, "30"
  PARAMID_149 = 149; // 3,13,3 леяъж, "3"
  PARAMID_150 = 150; // 3,13,4 бпелъ цндю, "2008 цнд беямю"
  PARAMID_151 = 151; // 3,14,1 пюгпеьемхе оепебндю, "0"
  PARAMID_152 = 152; // 3,14,2 вхякн, "26"
  PARAMID_153 = 153; // 3,14,3 леяъж, "10"
  PARAMID_154 = 154; // 3,14,4 бпелъ цндю, "2008 цнд няемэ"
  PARAMID_155 = 155; // 3,15,1 пюгпеьемхе оепебндю, "1"
  PARAMID_156 = 156; // 3,15,2 вхякн, "29"
  PARAMID_157 = 157; // 3,15,3 леяъж, "3"
  PARAMID_158 = 158; // 3,15,4 бпелъ цндю, "2009 цнд беямю"
  PARAMID_159 = 159; // 3,16,1 пюгпеьемхе оепебндю, "0"
  PARAMID_160 = 160; // 3,16,2 вхякн, "25"
  PARAMID_161 = 161; // 3,16,3 леяъж, "10"
  PARAMID_162 = 162; // 3,16,4 бпелъ цндю, "2009 цнд няемэ"
  PARAMID_163 = 163; // 3,17,1 пюгпеьемхе оепебндю, "1"
  PARAMID_164 = 164; // 3,17,2 вхякн, "28"
  PARAMID_165 = 165; // 3,17,3 леяъж, "3"
  PARAMID_166 = 166; // 3,17,4 бпелъ цндю, "2010 цнд беямю"
  PARAMID_167 = 167; // 3,18,1 пюгпеьемхе оепебндю, "0"
  PARAMID_168 = 168; // 3,18,2 вхякн, "31"
  PARAMID_169 = 169; // 3,18,3 леяъж, "10"
  PARAMID_170 = 170; // 3,18,4 бпелъ цндю, "2010 цнд няемэ"
  PARAMID_171 = 171; // 3,19,1 пюгпеьемхе оепебндю, "1"
  PARAMID_172 = 172; // 3,19,2 вхякн, "27"
  PARAMID_173 = 173; // 3,19,3 леяъж, "3"
  PARAMID_174 = 174; // 3,19,4 бпелъ цндю, "2011 цнд беямю"
  PARAMID_175 = 175; // 3,20,1 пюгпеьемхе оепебндю, "0"
  PARAMID_176 = 176; // 3,20,2 вхякн, "25"
  PARAMID_177 = 177; // 3,20,3 леяъж, "10"
  PARAMID_178 = 178; // 3,20,4 бпелъ цндю, "2011 цнд няемэ"

  /////////////////////////////////////////////////////////////////////////////
  // 5, мюхлемнбюмхе рхонб нокюрш

  PARAMID_PAYMENT_NAME_CASH = 193; // 5,1,1 гюопнцпюллхпнбюммше рхош нокюрш, "мюкхвмшлх"
  PARAMID_PAYMENT_NAME_CREDIT = 194; // 5,2,1 гюопнцпюллхпнбюммше рхош нокюрш, "нокюрю 1"
  PARAMID_PAYMENT_NAME_TARE = 195; // 5,3,1 гюопнцпюллхпнбюммше рхош нокюрш, "нокюрю 2"
  PARAMID_PAYMENT_NAME_CARD = 196; // 5,4,1 гюопнцпюллхпнбюммше рхош нокюрш, "окюр. йюпрни"

  /////////////////////////////////////////////////////////////////////////////
  // 6, мюкнцнбше ярюбйх

  PARAMID_TAX_RATE_1 = 197; // 6,1,1 бекхвхмю мюкнцю, "0"
  PARAMID_TAX_NAME_1 = 198; // 6,1,2 мюгбюмхе мюкнцю, "мюкнц я опндюф"
  PARAMID_TAX_RATE_2 = 199; // 6,2,1 бекхвхмю мюкнцю, "0"
  PARAMID_TAX_NAME_2 = 200; // 6,2,2 мюгбюмхе мюкнцю, "мдя"
  PARAMID_TAX_RATE_3 = 201; // 6,3,1 бекхвхмю мюкнцю, "0"
  PARAMID_TAX_NAME_3 = 202; // 6,3,2 мюгбюмхе мюкнцю, ""
  PARAMID_TAX_RATE_4 = 203; // 6,4,1 бекхвхмю мюкнцю, "0"
  PARAMID_TAX_NAME_4 = 204; // 6,4,2 мюгбюмхе мюкнцю, ""

  /////////////////////////////////////////////////////////////////////////////
  // 7, мюхлемнбюмхе нрдекнб

  PARAMID_DEPARTMENT_NAME_1 = 205; // 7,1,1 гюопнцпюллхпнбюммше мюгбюмхъ яейжхи, "1"
  PARAMID_DEPARTMENT_NAME_2 = 206; // 7,2,1 гюопнцпюллхпнбюммше мюгбюмхъ яейжхи, "2"
  PARAMID_DEPARTMENT_NAME_3 = 207; // 7,3,1 гюопнцпюллхпнбюммше мюгбюмхъ яейжхи, "3"
  PARAMID_DEPARTMENT_NAME_4 = 208; // 7,4,1 гюопнцпюллхпнбюммше мюгбюмхъ яейжхи, "4"
  PARAMID_DEPARTMENT_NAME_5 = 209; // 7,5,1 гюопнцпюллхпнбюммше мюгбюмхъ яейжхи, "5"
  PARAMID_DEPARTMENT_NAME_6 = 210; // 7,6,1 гюопнцпюллхпнбюммше мюгбюмхъ яейжхи, "6"
  PARAMID_DEPARTMENT_NAME_7 = 211; // 7,7,1 гюопнцпюллхпнбюммше мюгбюмхъ яейжхи, "7"
  PARAMID_DEPARTMENT_NAME_8 = 212; // 7,8,1 гюопнцпюллхпнбюммше мюгбюмхъ яейжхи, "8"
  PARAMID_DEPARTMENT_NAME_9 = 213; // 7,9,1 гюопнцпюллхпнбюммше мюгбюмхъ яейжхи, "9"
  PARAMID_DEPARTMENT_NAME_10 = 214; // 7,10,1 гюопнцпюллхпнбюммше мюгбюмхъ яейжхи, "10"
  PARAMID_DEPARTMENT_NAME_11 = 215; // 7,11,1 гюопнцпюллхпнбюммше мюгбюмхъ яейжхи, "11"
  PARAMID_DEPARTMENT_NAME_12 = 216; // 7,12,1 гюопнцпюллхпнбюммше мюгбюмхъ яейжхи, "12"
  PARAMID_DEPARTMENT_NAME_13 = 217; // 7,13,1 гюопнцпюллхпнбюммше мюгбюмхъ яейжхи, "13"
  PARAMID_DEPARTMENT_NAME_14 = 218; // 7,14,1 гюопнцпюллхпнбюммше мюгбюмхъ яейжхи, "14"
  PARAMID_DEPARTMENT_NAME_15 = 219; // 7,15,1 гюопнцпюллхпнбюммше мюгбюмхъ яейжхи, "15"
  PARAMID_DEPARTMENT_NAME_16 = 220; // 7,16,1 гюопнцпюллхпнбюммше мюгбюмхъ яейжхи, "16"

  /////////////////////////////////////////////////////////////////////////////
  // 8, мюярпнийю ьпхтрнб

  PARAMID_TEXT_FONT = 221; // 8,1,1 рейяр б вейе, "1"
  PARAMID_TRAILER_FONT = 222; // 8,1,2 пейкюлмши рейяр, "1"
  PARAMID_HEADER_FONT = 223; // 8,1,3 гюцнкнбнй вейю, "1"
  PARAMID_OPLINE1_FONT = 224; // 8,1,4 1 ярпнйю б ноепюжхх, "1"
  PARAMID_OPLINE2_FONT = 225; // 8,1,5 2 ярпнйю б ноепюжхх, "1"
  PARAMID_OPLINE3_FONT = 226; // 8,1,6 3 ярпнйю б ноепюжхх, "1"
  PARAMID_DSC_LINE1_FONT = 227; // 8,1,7 1 ярпнйю б яйхдйе, "1"
  PARAMID_DSC_LINE2_FONT = 228; // 8,1,8 2 ярпнйю б яйхдйе, "1"
  PARAMID_CHR_LINE1_FONT = 229; // 8,1,9 1 ярпнйю б мюдаюбйе, "1"
  PARAMID_CHR_LINE2_FONT = 230; // 8,1,10 2 ярпнйю б мюдаюбйе, "1"
  PARAMID_SDSC_LINE1_FONT = 231; // 8,1,11 1 ярпнйю б ярнпмн яйхдйх, "1"
  PARAMID_SDSC_LINE2_FONT = 232; // 8,1,12 2 ярпнйю б ярнпмн яйхдйх, "1"
  PARAMID_SCHR_LINE1_FONT = 233; // 8,1,13 1 ярпнйю б ярнпмн мюдаюбйх, "1"
  PARAMID_SCHR_LINE2_FONT = 234; // 8,1,14 2 ярпнйю б ярнпмн мюдаюбйх, "1"
  PARAMID_CLOSE_TEXT_FONT = 235; // 8,1,15 ярпнйю б гюйпшрхх вейю, "1"
  PARAMID_CLOSE_DSC_FONT = 236; // 8,1,16 яйхдйю б гюйпшрхх вейю, "1"
  PARAMID_CLOSE_AMOUNT_FONT = 237; // 8,1,17 бяецн б гюйпшрхх вейю, "1"
  PARAMID_CLOSE_TOTAL_FONT = 238; // 8,1,18 хрнц вейю, "2"
  PARAMID_PAY_TYPE_FONT = 239; // 8,1,19 рейяр б рхое нокюрш, "1"
  PARAMID_CHANGE_FONT = 240; // 8,1,20 рейяр б ядюве, "1"
  PARAMID_TAX_TURNOVER_FONT = 241; // 8,1,21 нанпнр он мюкнцюл, "1"
  PARAMID_TAX_FONT = 242; // 8,1,22 мюкнцх, "1"

  /////////////////////////////////////////////////////////////////////////////
  // 9, рюакхжю тнплюрю вейю

  PARAMID_243 = 243; // 9,1,1 мнлеп ярпнйх, "1"
  PARAMID_244 = 244; // 9,1,2 ялеыемхе б ярпнйе (б яхлбнкюу), "0"
  PARAMID_245 = 245; // 9,1,3 пюглеп (б яхлбнкюу), "48"
  PARAMID_246 = 246; // 9,1,4 бшпюбмхбюмхе, "0"
  PARAMID_247 = 247; // 9,1,5 мюхлемнбюмхе, "мюхлемнбюмхе б ноепюжхх"
  PARAMID_248 = 248; // 9,2,1 мнлеп ярпнйх, "2"
  PARAMID_249 = 249; // 9,2,2 ялеыемхе б ярпнйе (б яхлбнкюу), "18"
  PARAMID_250 = 250; // 9,2,3 пюглеп (б яхлбнкюу), "30"
  PARAMID_251 = 251; // 9,2,4 бшпюбмхбюмхе, "1"
  PARAMID_252 = 252; // 9,2,5 мюхлемнбюмхе, "йнкхвеярбн X жемс б ноепюжхх"
  PARAMID_253 = 253; // 9,3,1 мнлеп ярпнйх, "3"
  PARAMID_254 = 254; // 9,3,2 ялеыемхе б ярпнйе (б яхлбнкюу), "0"
  PARAMID_255 = 255; // 9,3,3 пюглеп (б яхлбнкюу), "20"
  PARAMID_256 = 256; // 9,3,4 бшпюбмхбюмхе, "0"
  PARAMID_257 = 257; // 9,3,5 мюхлемнбюмхе, "яейжхъ б ноепюжхх"
  PARAMID_258 = 258; // 9,4,1 мнлеп ярпнйх, "3"
  PARAMID_259 = 259; // 9,4,2 ялеыемхе б ярпнйе (б яхлбнкюу), "31"
  PARAMID_260 = 260; // 9,4,3 пюглеп (б яхлбнкюу), "17"
  PARAMID_261 = 261; // 9,4,4 бшпюбмхбюмхе, "1"
  PARAMID_262 = 262; // 9,4,5 мюхлемнбюмхе, "ярнхлнярэ б ноепюжхх"
  PARAMID_263 = 263; // 9,5,1 мнлеп ярпнйх, "2"
  PARAMID_264 = 264; // 9,5,2 ялеыемхе б ярпнйе (б яхлбнкюу), "0"
  PARAMID_265 = 265; // 9,5,3 пюглеп (б яхлбнкюу), "10"
  PARAMID_266 = 266; // 9,5,4 бшпюбмхбюмхе, "0"
  PARAMID_267 = 267; // 9,5,5 мюхлемнбюмхе, "мюдохяэ ярнпмн б ноепюжхх"
  PARAMID_268 = 268; // 9,6,1 мнлеп ярпнйх, "1"
  PARAMID_269 = 269; // 9,6,2 ялеыемхе б ярпнйе (б яхлбнкюу), "0"
  PARAMID_270 = 270; // 9,6,3 пюглеп (б яхлбнкюу), "48"
  PARAMID_271 = 271; // 9,6,4 бшпюбмхбюмхе, "0"
  PARAMID_272 = 272; // 9,6,5 мюхлемнбюмхе, "рейяр б яйхдйе"
  PARAMID_273 = 273; // 9,7,1 мнлеп ярпнйх, "2"
  PARAMID_274 = 274; // 9,7,2 ялеыемхе б ярпнйе (б яхлбнкюу), "0"
  PARAMID_275 = 275; // 9,7,3 пюглеп (б яхлбнкюу), "10"
  PARAMID_276 = 276; // 9,7,4 бшпюбмхбюмхе, "0"
  PARAMID_277 = 277; // 9,7,5 мюхлемнбюмхе, "мюдохяэ яйхдйю"
  PARAMID_278 = 278; // 9,8,1 мнлеп ярпнйх, "2"
  PARAMID_279 = 279; // 9,8,2 ялеыемхе б ярпнйе (б яхлбнкюу), "31"
  PARAMID_280 = 280; // 9,8,3 пюглеп (б яхлбнкюу), "17"
  PARAMID_281 = 281; // 9,8,4 бшпюбмхбюмхе, "1"
  PARAMID_282 = 282; // 9,8,5 мюхлемнбюмхе, "ясллю яйхдйх"
  PARAMID_283 = 283; // 9,9,1 мнлеп ярпнйх, "1"
  PARAMID_284 = 284; // 9,9,2 ялеыемхе б ярпнйе (б яхлбнкюу), "0"
  PARAMID_285 = 285; // 9,9,3 пюглеп (б яхлбнкюу), "48"
  PARAMID_286 = 286; // 9,9,4 бшпюбмхбюмхе, "0"
  PARAMID_287 = 287; // 9,9,5 мюхлемнбюмхе, "рейяр б мюдаюбйе"
  PARAMID_288 = 288; // 9,10,1 мнлеп ярпнйх, "2"
  PARAMID_289 = 289; // 9,10,2 ялеыемхе б ярпнйе (б яхлбнкюу), "0"
  PARAMID_290 = 290; // 9,10,3 пюглеп (б яхлбнкюу), "10"
  PARAMID_291 = 291; // 9,10,4 бшпюбмхбюмхе, "0"
  PARAMID_292 = 292; // 9,10,5 мюхлемнбюмхе, "мюдохяэ мюдаюбйю"
  PARAMID_293 = 293; // 9,11,1 мнлеп ярпнйх, "2"
  PARAMID_294 = 294; // 9,11,2 ялеыемхе б ярпнйе (б яхлбнкюу), "31"
  PARAMID_295 = 295; // 9,11,3 пюглеп (б яхлбнкюу), "17"
  PARAMID_296 = 296; // 9,11,4 бшпюбмхбюмхе, "1"
  PARAMID_297 = 297; // 9,11,5 мюхлемнбюмхе, "ясллю мюдаюбйх"
  PARAMID_298 = 298; // 9,12,1 мнлеп ярпнйх, "1"
  PARAMID_299 = 299; // 9,12,2 ялеыемхе б ярпнйе (б яхлбнкюу), "0"
  PARAMID_300 = 300; // 9,12,3 пюглеп (б яхлбнкюу), "48"
  PARAMID_301 = 301; // 9,12,4 бшпюбмхбюмхе, "0"
  PARAMID_302 = 302; // 9,12,5 мюхлемнбюмхе, "рейяр б ярнпмн яйхдйх"
  PARAMID_303 = 303; // 9,13,1 мнлеп ярпнйх, "2"
  PARAMID_304 = 304; // 9,13,2 ялеыемхе б ярпнйе (б яхлбнкюу), "0"
  PARAMID_305 = 305; // 9,13,3 пюглеп (б яхлбнкюу), "16"
  PARAMID_306 = 306; // 9,13,4 бшпюбмхбюмхе, "0"
  PARAMID_307 = 307; // 9,13,5 мюхлемнбюмхе, "мюдохяэ ярнпмн яйхдйх"
  PARAMID_308 = 308; // 9,14,1 мнлеп ярпнйх, "2"
  PARAMID_309 = 309; // 9,14,2 ялеыемхе б ярпнйе (б яхлбнкюу), "31"
  PARAMID_310 = 310; // 9,14,3 пюглеп (б яхлбнкюу), "17"
  PARAMID_311 = 311; // 9,14,4 бшпюбмхбюмхе, "1"
  PARAMID_312 = 312; // 9,14,5 мюхлемнбюмхе, "ясллю ярнпмн яйхдйх"
  PARAMID_313 = 313; // 9,15,1 мнлеп ярпнйх, "1"
  PARAMID_314 = 314; // 9,15,2 ялеыемхе б ярпнйе (б яхлбнкюу), "0"
  PARAMID_315 = 315; // 9,15,3 пюглеп (б яхлбнкюу), "48"
  PARAMID_316 = 316; // 9,15,4 бшпюбмхбюмхе, "0"
  PARAMID_317 = 317; // 9,15,5 мюхлемнбюмхе, "рейяр б ярнпмн мюдаюбйх"
  PARAMID_318 = 318; // 9,16,1 мнлеп ярпнйх, "2"
  PARAMID_319 = 319; // 9,16,2 ялеыемхе б ярпнйе (б яхлбнкюу), "0"
  PARAMID_320 = 320; // 9,16,3 пюглеп (б яхлбнкюу), "16"
  PARAMID_321 = 321; // 9,16,4 бшпюбмхбюмхе, "0"
  PARAMID_322 = 322; // 9,16,5 мюхлемнбюмхе, "мюдохяэ ярнпмн мюдаюбйх"
  PARAMID_323 = 323; // 9,17,1 мнлеп ярпнйх, "2"
  PARAMID_324 = 324; // 9,17,2 ялеыемхе б ярпнйе (б яхлбнкюу), "31"
  PARAMID_325 = 325; // 9,17,3 пюглеп (б яхлбнкюу), "17"
  PARAMID_326 = 326; // 9,17,4 бшпюбмхбюмхе, "1"
  PARAMID_327 = 327; // 9,17,5 мюхлемнбюмхе, "ясллю ярнпмн мюдаюбйх"

  /////////////////////////////////////////////////////////////////////////////
  // 10, яксфеамюъ

  PARAMID_328 = 328; // 10,1,1 пюяярнъмхе нр цнкнбйх дн мнфю, "80"
  PARAMID_329 = 329; // 10,1,2 пюяярнъмхе нр мнфю дн цпеаемйх, "165"
  PARAMID_330 = 330; // 10,1,3 мхфмхи онпнц мюопъфемхъ, "180"
  PARAMID_331 = 331; // 10,1,4 бепумхи онпнц мюопъфемхъ, "240"
  PARAMID_332 = 332; // 10,1,5 гюпегепбхпнбюмн, "0"

  /////////////////////////////////////////////////////////////////////////////
  // 4, рейяр б вейе

  PARAMID_HEADER_LINE_1 = 400;
  PARAMID_HEADER_LINE_2 = 401;
  PARAMID_HEADER_LINE_3 = 402;

  PARAMID_TRAILER_LINE_1 = 500;
  PARAMID_TRAILER_LINE_2 = 501;
  PARAMID_TRAILER_LINE_3 = 502;


  /////////////////////////////////////////////////////////////////////////////
  // Daily total constants

  SMFPTR_DAILY_TOTAL_ALL    = 0;
  SMFPTR_DAILY_TOTAL_CASH   = 1;
  SMFPTR_DAILY_TOTAL_PT2    = 2;
  SMFPTR_DAILY_TOTAL_PT3    = 3;
  SMFPTR_DAILY_TOTAL_PT4    = 4;

implementation

end.


